{"config": [{"config": {"use_bias": true, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_4", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "filters": 16, "kernel_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_5", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "filters": 16, "kernel_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_6", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null, "filters": 8, "kernel_constraint": null, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"rate": 0.2, "noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activity_regularizer": null, "units": 128, "bias_regularizer": null, "trainable": true, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"use_bias": true, "activity_regularizer": null, "units": 2, "bias_regularizer": null, "trainable": true, "activation": "softmax", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}